{
  "pageProps": {
    "post": {
      "slug": "25",
      "content": "\n### Table of Contents\n\n- [Back to Campus & New Beginnings](#back-to-campus-new-beginnings)\n- [Bengaluru & Startup Hustle](#bengaluru-startup-hustle)\n- [Growth, Pivots & AI](#growth-pivots-ai)\n- [Change, Reflection & New Chapters](#change-reflection-new-chapters)\n- [Hummingbird Tales & Travels](#hummingbird-tales-travels)\n- [Kay.ai, More Journeys & Looking Ahead](#kayai-more-journeys-looking-ahead)\n- [2025 & The Road Ahead](#2025-the-road-ahead)\n\n---\n\n> **So I am 25.**  \n> _I am grateful for my past 25 years—maybe not the best, but still very good. And today, I want to aim for what would come next._\n\n---\n\nBefore that, I want to take a step back and thank the people who have been there for me all along. Below I am trying to reflect on my journey, especially from my last such significant year (18) to today (25). Since there are many incidents and many details, I will try to cut short things—not going into details—to give a brief of the journey.\n\nFirstly, my parents, supporting me heavily during my whole education, and letting me take decisions like moving to [IIT Jodhpur](https://www.iitj.ac.in/), leaving [NDA](https://en.wikipedia.org/wiki/National_Defence_Academy_(India)) for Technology, leaving job security for trying out a startup, and today again not going to an MNC for a fast-growing startup.\n\nMy father is a businessman or entrepreneur; I will say he has had many ups and downs in his ventures as well, some shut down in the past as well but he always made sure we aren’t affected by that, keeping us shielded.\n\nMy mom married at 18, had kids soon afterwards, later did her post-graduation and was working, but left to focus on our (me and my brothers’) studies and behaviour more—without which we might not have turned out who we are today.\n\nAt 18, I took a decision, moved [IIT Jodhpur](https://www.iitj.ac.in/) above [IIT Patna](https://www.iitp.ac.in/) myself in [JoSAA](https://josaa.nic.in/) preference because I wanted to get out of my comfort zone and experience something new and challenging. Even though IITP > IITJ at that time ([NIRF](https://www.nirfindia.org/) 22 > 54), still took the bet and—one of the best decisions of my life.\n\nI started out by focusing on my field, mechanical engineering, trying to study it well, participating in things that could give me the best exposure ([SAE BAJA](https://en.wikipedia.org/wiki/Baja_SAE)) but realized it’s not for me.\n\nAt that time, Abhinav shared a message on our WhatsApp group asking if people wanna join him for web-dev. I shared my interest but asked for time since I was involved in [BAJA](https://en.wikipedia.org/wiki/Baja_SAE) fully for some more months. He agreed, I showed up and got a lot to learn.\n\nIn college life, I had spent mostly my whole 1st year in my room or [BAJA](https://en.wikipedia.org/wiki/Baja_SAE). So, decided to step out more in 2nd year. Led the Informals Club (organizing festivities and events) on campus that year, was in core team for organizing college cultural event (Spandan’19), Literature Fest (Aftaab’19), joined our college festival [IGNUS](https://ignus.co.in/)’20 as Assistant Head - Events (organizing group dance), had an offer to head social events that year, but chose former because that’s what excited me more.\n\nPhenomenal event and experience, made some really great friends in these months whom I will always stay in touch with again.\n\nIdeally, if COVID hadn’t happened I would have kept my eye on becoming the Festival Chief for Ignus—something I had worked towards and shared with current FCs as well—but COVID and everything went to clouds.\n\n---\n\n**March 2020 - COVID happened.**\n\nOf course, headed back home. COVID and studies from home turned out to be a great thing for me; I wasn’t really into the core subjects my field has to offer a lot, so spent most of my time learning around software engineering (the best part I love which gives me the drive even today is how we can solve so many problems at such a great pace using software).\n\nCOVID was a very bad phase for all of us, Patna being a good urban town with lots of rural and sub-developed places nearby saw folks coming to town for treatments and the overall condition was very bad.\n\nMy father, with other society members, used to provide oxygen cylinders and more to the needy.\n\nI collaborated with [Abhinav](https://x.com/imabhinavrai) and another alum working with an NGO, automating their WhatsApp; they were getting tonnes of requests on their WhatsApp for help. We helped them categorize that into things like what’s the item in need (medicines, oxygen, others), which town, urgency—so that the NGO could help them better. Felt good helping in any way possible.\n\n---\n\nBy this time, we were working on Profilebud (an Instagram leads-scraping tool) – it was doing good revenue especially through solopreneurs and small businesses, but it was a rat-and-mice game where Meta used to enhance their security and we’d try to figure out a way around it.\n\nOne day, we received an email for cease and desist from Meta, Abhinav called at the same time, we were like **SHIT!** But knew this was coming; this was a sad time because we knew we had to give something up which was doing good and we had built it with so much love and passion.\n\nBut wait—later it turned out that the email it was sent from wasn’t really any legitimate litigator and was fake instead. Fuck, so close. Not really, we knew this would actually come someday, and it did later in the journey.\n\nThough this time it was better, and we went through with it. But decided to keep the core team and build something new (legit). Had some brainstorming sessions; we decided to bring our experience in Meta into e-commerce specifically the Shopify ecosystem—built [Influencerbit](https://influencerbit.com/) (a customer-led influencer-marketing platform) the core idea being: dive into the millions of Instagram followers you have and make them your brand ambassadors. More on this later now.\n\nNow, I was working in Influencerbit as Co-Founder / CTO and was mostly thinking to continue the same after college as well, but seeing friends getting placed and nice packages kinda left me feeling left behind, plus my parents were very tensed, so I decided to sit in the placements finally. After a few rejections, got an offer for SDE from AU Bank (15 LPA - Jaipur). Good enough—having an offer in hand made my parents calm and I could focus back now.\n\n---\n\n#### Back to Campus & New Beginnings\n\nIn college, it’s Dec ’21 now, a few of us have gotten permission from the institute to return to campus to continue our studies. I took a flight from Patna to Delhi, went to Old Delhi Railway Station where I had a train to Jodhpur. I kept my belongings in my seat, went for washroom and when returned my laptop bag was missing; there was an army soldier on the seat above who helped me search around and talk to RPF regarding this though nothing actually worked.\n\nSitting sadly, a family who was travelling in the same coach offered to join for dinner—was good. Finally reached Jodhpur, went to college, and 4 days’ quarantine (precaution); it was tough without a laptop—couldn’t work or do anything. I watched **GOT** for the first time in these 3.5 days and have been a die-hard fan since then.\n\nWhen I went back to hostel, first day went to city, got a new laptop and started again. These few last months were the best; I guess I interacted with many of my college mates whom I hadn’t interacted with earlier and made some really good bonds. We had Spandan, Holi and many small festivals with DJ Nights happening almost every weekend—fun times.\n\n---\n\n#### Bengaluru & Startup Hustle\n\nNow, in my company we were pivoting from Influencerbit to Engagebud (e-commerce gamification platform) this time plus team had moved to Bengaluru at this time; I wanted to be there as well, plus a lot of work on company side, so finally made the move in April ’22 to Bengaluru—missed farewells and some more stuff (regret this).\n\nNow, Bengaluru was fun: a 22-year-old working out of cowork trying to build something of their own—that’s what startup and young energy should be about isn’t it.\n\nSo, we used to live in Brookfield at the time—me, Abhinav and Kabir (Abhinav’s brother and leading sales). We used to work hard and party hard, throwing some crazy house parties, karaoke and brownie sessions, racing on F1 PS4 when back from work. **HAHA!**\n\nIn a few months, many of my friends moved to Bengaluru as well; luckily most of us were living in very close proximity so we used to hang out a lot, having chitchat / green sessions now and then. Actually, I also met some more batchmates whom I had little / no interaction with in college and became good friends.\n\nI have gotten into some new things during these times like greens, techno and house music, F1, and trying to become extrovert as well.\n\n---\n\n#### Growth, Pivots & AI\n\nTill date, after grad, in Bengaluru I was taking in hand 40 K where food and rent were coming from company. Around end of 2022, we raised $100 K from [Upekkha](https://upekkha.io/) to help growth there, but the fundamental questions that Upekkha made us ask made us realize that Engagebud can’t be the SaaS that we were thinking about, and need to rethink.\n\nWe started exploring other problems as well; in this time ChatGPT happened—magical moment. Being engineers, it was the best play to go into AI, and we did. We experimented around with some smaller tools (Prompts Library, AI over Sheets) and finally doubled down on Dreamboat.ai (LLMOps tool for analytics, logging and prompt management).\n\nWe invested a lot of time and power in it, built the whole platform in a couple of months, started to attend AI events and conferences, trying to market it. Now, the realization: it can succeed but it’s gonna be a slow process and take good enough time (5-7 years) and funds as well.\n\n---\n\n#### Change, Reflection & New Chapters\n\nNow, 1.5 years ahead after college (Nov' 23), this is a time where I was taking 1.5 Lacs salary now (from May '23), and was feeling left behind—as in if I was working I could be making much more and if I wanted to spend my time in startup building something on own, it would be around making substantial value.\n\nHere, things around vision for company as well as individuals what we wanted to do didn’t align which we felt could happen and decided to split ways in Nov '23.\n\nI decided I want to be in AI space and be an expert on it, but having been working from '20 continuously, decided to take a break to give myself some breathing space.\n\nBig thanks to [Abhinav](https://x.com/imabhinavrai) for being there through it all. Despite our differences, I’m grateful for the time we shared and everything I learned from him — both as an engineer and as a person.\n\n---\n\n#### Hummingbird Tales & Travels\n\nOff work, [Venkatesh](https://x.com/venky_says) (batchmate) and me talked around moving to Indiranagar and made that happen in May ’2023. I met two more friends (Samiksha, Vishakha) who are currently two of my closest friends. Our building name was **The Hummingbird** and here started the Hummingbird Tales, exploring cafes, bars, pubs, game nights regularly.\nGot too into greens for a while — wasn’t feeling great or productive. Thanks to my friends, I quit regular smoking. Now it’s just occasional, and I feel way better.\n\nWe travelled to Sri Lanka in Jan ’24 - one of the best places and experiences I ever had, travelled to more places around these times (Wayanad, Gokarna, Coonoor) mostly travel planned and led by the Gujju [Yashvi](https://x.com/YashviRamanuj).\n\n---\n\n#### Kay.ai, More Journeys & Looking Ahead\n\nIn March ’24, joined Kay.ai as a contractor for building the product; I was into AI space and product dev and MVPs have been my forte so it was the perfect fit. Two months into it, both of us decided to make this full-time, and I joined there full-time in May. The team is based out of New York; only me and 1 other colleague are in India.\n\nI love travelling; later explored more Kerala, went to Thailand (Bangkok, Ao Nang) during Diwali and Rajasthan (Udaipur, Jodhpur) in December as well as Hyderabad a couple of times.\n\nAah, a sad thing got rejected for US Visa twice in a period of 3-4 months, else I was looking forward for a US trip as well, but no worries.\n\n---\n\n#### 2025 & The Road Ahead\n\nI stepped into 2025 with a mission on doing more new things, especially with a remote job where later I might not have the same privilege: have caught up on working out, running, learnt swimming, reading more books, and learning DJ mixing. Have been to Mumbai and Goa in March / April ’25.\n\n**Professionally, I am aiming to be an AI Product Engineer—being great at product engineering, and getting better at AI—wanna provide the best of both worlds.**\n\nHad a crazy 25th birthday party, thanks to the hosts, [Venkatesh](https://x.com/venky_says) and [Yashvi](https://x.com/YashviRamanuj), and all the lovely folks who joined (you can find them in the pic below).\n\nReally looking forward to this new phase—setting up some more precise goals, working towards it, doing more of hobbies and travelling as well.\n\n_Something I left intentionally was the dating side during all this time, which is mostly non-existent and not so great, so a paragraph on that some other time._\n\n![25th Birthday Party](/content/blogs/25/25party.png)\n\n<div class=\"flex flex-row gap-4 justify-center items-start mt-4 mb-4\">\n  <img src=\"/content/blogs/25/ansh-phalke.jpg\" alt=\"More People\" class=\"max-h-96 rounded-lg object-contain\" style=\"max-width: 48%;\" />\n  <img src=\"/content/blogs/25/sam-vish.jpg\" alt=\"More People\" class=\"max-h-96 rounded-lg object-contain\" style=\"max-width: 48%;\" />\n</div>",
      "title": "25 — A Quick Reflection",
      "description": "A quick reflection on my journey from 18 to 25.",
      "date": "2025-05-10",
      "type": "thought",
      "tags": ["Personal"],
      "image": "/content/blogs/25/25.png"
    }
  },
  "__N_SSG": true
}
