{
  "pageProps": {
    "post": {
      "slug": "high-agency",
      "content": "\nOnly 1% of employees are truly proactive.\n\nBut these are the very best people.\n\nHigh agency is the ability to take action, make decisions, and own outcomes—without waiting to be told what to do. It's rare, but it's what separates average contributors from the people who change the game.\n\n#### What is High Agency?\n\nHigh-agency people don’t just take initiative—they *create* it.\n\nThey:\n- Act without waiting for permission.\n- Solve problems even outside their job description.\n- Constantly seek context, improvement, and leverage.\n\nThey don’t default to “not my job”—they default to “how can I help?”\n\n#### Are You High Agency? (A Self-Test)\n\nAsk yourself:\n\n- **Do you manage your boss, or does your boss manage you?**\n- **When you think of important company tasks—do you just get them done, or suggest that someone should?**\n- **Do you crawl internal docs and chats for context, or wait to be briefed?**\n- **When you miss deadlines, do you raise flags early—or do others tell *you* it’s late?**\n- **Do you try to improve processes, or just complete assigned tasks?**\n- **Do you default to “Yes, and…” or “No, but…”?**\n- **Are you pushing others to move faster—or do you need nudging?**\n- **Do you take ownership of org-wide issues—or assume someone else owns them?**\n- **Are you opportunity-oriented or risk-avoidant?**\n- **Do you anticipate leadership's next move—or react to their requests?**\n\nIf you answered on the proactive side for most, you’re in rare company.\n\n#### Why High Agency Matters\n\n- High-agency employees act like founders.\n- They multiply team momentum.\n- They spot problems before they become blockers.\n- In startups and lean orgs, they are the *engine*.\n\nLeaders don’t want to micromanage—they want partners who get it done.\n\n#### How to Build High Agency\n\n- **Take ownership**: Treat every task like you're the CEO of it.\n- **Ask yourself**: “What would I do if no one else was going to?”\n- **Learn broadly**: Context = leverage. Seek understanding, not just tasks.\n- **Improve the system**: Don’t just fix symptoms—fix root causes.\n- **Act, reflect, adapt**: Don’t wait for perfect clarity. Start, then course correct.\n\n#### Final Thought\n\nHigh agency isn’t about being a workhorse.\n\nIt’s about being the kind of person who leads—even without a title.\n\nSo ask yourself:  \n**What’s one thing you’ve been waiting for permission to do, that you could just start today?**\n",
      "title": "High Agency: The Trait That Sets Top Performers Apart",
      "description": "High-agency employees are rare but invaluable. Here's how to know if you're one—and how to become one.",
      "date": "2025-05-04",
      "type": "thought",
      "tags": ["career", "mindset", "proactive", "agency", "work"],
      "image": "/content/blogs/high-agency.png"
    }
  },
  "__N_SSG": true
}
